In [ ]:
import sqlite3

In [ ]:
db =  sqlite3.connect('ineuron.db')

In [ ]:
c = db.cursor()

In [ ]:
c.execute('CREATE TABLE IF NOT EXISTS fdsc (name TEXT, batch INTEGER, mark real)')

In [9]:
c.execute("INSERT INTO fdsc VALUES ('Amit', 1, 90.5)")
c.execute("INSERT INTO fdsc VALUES ('Ravi', 2, 85.0)")
c.execute("INSERT INTO fdsc VALUES ('Sita', 1, 88.0)")
c.execute("INSERT INTO fdsc VALUES ('Gita', 2, 92.0)")
c.execute("INSERT INTO fdsc VALUES ('Rahul', 1, 95.0)")
c.execute("INSERT INTO fdsc VALUES ('Priya', 2, 80.0)")
c.execute("INSERT INTO fdsc VALUES ('Anil', 1, 78.0)")

In [11]:
data = c.execute("Select * from fdsc")

In [12]:
for i in data:
    print(i)

('sachin', 1, 100.0)
('Amit', 1, 90.5)
('Ravi', 2, 85.0)
('Sita', 1, 88.0)
('Gita', 2, 92.0)
('Rahul', 1, 95.0)
('Priya', 2, 80.0)
('Anil', 1, 78.0)

In [14]:
db.commit()
db.close()

In [2]:
import sqlite3
db = sqlite3.connect('ineuron.db')
c = db.cursor()
result = c.execute('Select * from fdsc where mark > 90').fetchall()
db.close()
result

[('sachin', 1, 100.0),
 ('Amit', 1, 90.5),
 ('Gita', 2, 92.0),
 ('Rahul', 1, 95.0)]

In [6]:
# so i want to apply join operation so create two tables
db = sqlite3.connect('join_example.db')
c =db.cursor()
c.execute('CREATE TABLE IF NOT EXISTS student (student_id INTEGER, name TEXT, age INTEGER, mail TEXT, mark INTEGER)')
c.execute('CREATE TABLE IF NOT EXISTS address (student_id INTEGER, pin_code INTEGER, location TEXT, nearby TEXT, phone_no INTEGER)')

In [7]:
# Insert 12 dummy student records
c.execute('INSERT INTO student VALUES (1, "John Doe", 20, "john.doe@gmail.com", 85)')
c.execute('INSERT INTO student VALUES (2, "Jane Smith", 21, "jane.smith@gmail.com", 92)')
c.execute('INSERT INTO student VALUES (3, "Mike Johnson", 19, "mike.johnson@gmail.com", 78)')
c.execute('INSERT INTO student VALUES (4, "Sarah Wilson", 22, "sarah.wilson@gmail.com", 88)')
c.execute('INSERT INTO student VALUES (5, "David Brown", 20, "david.brown@gmail.com", 95)')
c.execute('INSERT INTO student VALUES (6, "Emily Davis", 23, "emily.davis@gmail.com", 82)')
c.execute('INSERT INTO student VALUES (7, "Chris Miller", 21, "chris.miller@gmail.com", 90)')
c.execute('INSERT INTO student VALUES (8, "Lisa Garcia", 19, "lisa.garcia@gmail.com", 87)')
c.execute('INSERT INTO student VALUES (9, "Tom Anderson", 24, "tom.anderson@gmail.com", 91)')
c.execute('INSERT INTO student VALUES (10, "Amy Taylor", 20, "amy.taylor@gmail.com", 83)')
c.execute('INSERT INTO student VALUES (11, "Ryan Thomas", 22, "ryan.thomas@gmail.com", 89)')
c.execute('INSERT INTO student VALUES (12, "Jessica Lee", 21, "jessica.lee@gmail.com", 94)')
db.commit()
print("12 student records inserted successfully!")

12 student records inserted successfully!

In [8]:
# Display all student records clearly
result = c.execute('SELECT * FROM student ORDER BY student_id').fetchall()
print(f"Total students in database: {len(result)}")
print("=" * 90)
print(f"{'ID':<3} | {'Name':<15} | {'Age':<3} | {'Email':<25} | {'Mark':<4}")
print("-" * 90)
for record in result:
    print(f"{record[0]:<3} | {record[1]:<15} | {record[2]:<3} | {record[3]:<25} | {record[4]:<4}")
print("=" * 90)

Total students in database: 12
==========================================================================================
ID  | Name            | Age | Email                     | Mark
------------------------------------------------------------------------------------------
1   | John Doe        | 20  | john.doe@gmail.com        | 85
2   | Jane Smith      | 21  | jane.smith@gmail.com      | 92
3   | Mike Johnson    | 19  | mike.johnson@gmail.com    | 78
4   | Sarah Wilson    | 22  | sarah.wilson@gmail.com    | 88
5   | David Brown     | 20  | david.brown@gmail.com     | 95
6   | Emily Davis     | 23  | emily.davis@gmail.com     | 82
7   | Chris Miller    | 21  | chris.miller@gmail.com    | 90
8   | Lisa Garcia     | 19  | lisa.garcia@gmail.com     | 87
9   | Tom Anderson    | 24  | tom.anderson@gmail.com    | 91
10  | Amy Taylor      | 20  | amy.taylor@gmail.com      | 83
11  | Ryan Thomas     | 22  | ryan.thomas@gmail.com     | 89
12  | Jessica Lee     | 21  | jessica.lee@gmail.com     | 94
==========================================================================================

In [9]:
c.execute('INSERT INTO address VALUES (1, 123456, "New York", "Central Park", 1234567890)')
c.execute('INSERT INTO address VALUES (2, 234567, "Los Angeles", "Hollywood", 2345678901)')
c.execute('INSERT INTO address VALUES (3, 345678, "Chicago", "Downtown", 3456789012)')
c.execute('INSERT INTO address VALUES (4, 456789, "Houston", "Galleria", 4567890123)')
c.execute('INSERT INTO address VALUES (5, 567890, "Phoenix", "Desert Ridge", 5678901234)')
c.execute('INSERT INTO address VALUES (6, 678901, "San Francisco", "Golden Gate", 6789012345)')
c.execute('INSERT INTO address VALUES (7, 789012, "Seattle", "Pike Place", 7890123456)')
c.execute('INSERT INTO address VALUES (8, 890123, "Miami", "South Beach", 8901234567)')
c.execute('INSERT INTO address VALUES (9, 901234, "Boston", "Fenway Park", 9012345678)')
c.execute('INSERT INTO address VALUES (10, 123456, "Atlanta", "Centennial Park", 1234567890)')
c.execute('INSERT INTO address VALUES (11, 234567, "Dallas", "Deep Ellum", 2345678901)')
c.execute('INSERT INTO address VALUES (12, 345678, "Denver", "Lodo", 3456789012)')
db.commit()

In [10]:
# Display all address records clearly
result = c.execute('SELECT * FROM address ORDER BY student_id').fetchall()
print(f"Total addresses in database: {len(result)}")  
print("=" * 90)
print(f"{'ID':<3} | {'Pin Code':<8} | {'Location':<15} | {'Nearby':<15} | {'Phone No':<10}")
print("-" * 90)
for record in result:
    print(f"{record[0]:<3} | {record[1]:<8} | {record[2]:<15} | {record[3]:<15} | {record[4]:<10}")
db.close()

Total addresses in database: 12
==========================================================================================
ID  | Pin Code | Location        | Nearby          | Phone No
------------------------------------------------------------------------------------------
1   | 123456   | New York        | Central Park    | 1234567890
2   | 234567   | Los Angeles     | Hollywood       | 2345678901
3   | 345678   | Chicago         | Downtown        | 3456789012
4   | 456789   | Houston         | Galleria        | 4567890123
5   | 567890   | Phoenix         | Desert Ridge    | 5678901234
6   | 678901   | San Francisco   | Golden Gate     | 6789012345
7   | 789012   | Seattle         | Pike Place      | 7890123456
8   | 890123   | Miami           | South Beach     | 8901234567
9   | 901234   | Boston          | Fenway Park     | 9012345678
10  | 123456   | Atlanta         | Centennial Park | 1234567890
11  | 234567   | Dallas          | Deep Ellum      | 2345678901
12  | 345678   | Denver          | Lodo            | 3456789012

In [11]:
# apply left join operation
db = sqlite3.connect('join_example.db')
c = db.cursor()
result = c.execute('SELECT student.name, student.age, student.mail, address.pin_code, address.location FROM student LEFT JOIN address ON student.student_id = address.student_id').fetchall()
print(f"Total records after left join: {len(result)}")  
print("=" * 90)
print(f"{'Name':<15} | {'Age':<3} | {'Email':<25} | {'Pin Code':<8} | {'Location':<15}")
print("-" * 90)
for record in result:
    print(f"{record[0]:<15} | {record[1]:<3} | {record[2]:<25} | {record[3]:<8} | {record[4]:<15}")
db.close()

Total records after left join: 12
==========================================================================================
Name            | Age | Email                     | Pin Code | Location
------------------------------------------------------------------------------------------
John Doe        | 20  | john.doe@gmail.com        | 123456   | New York
Jane Smith      | 21  | jane.smith@gmail.com      | 234567   | Los Angeles
Mike Johnson    | 19  | mike.johnson@gmail.com    | 345678   | Chicago
Sarah Wilson    | 22  | sarah.wilson@gmail.com    | 456789   | Houston
David Brown     | 20  | david.brown@gmail.com     | 567890   | Phoenix
Emily Davis     | 23  | emily.davis@gmail.com     | 678901   | San Francisco
Chris Miller    | 21  | chris.miller@gmail.com    | 789012   | Seattle
Lisa Garcia     | 19  | lisa.garcia@gmail.com     | 890123   | Miami
Tom Anderson    | 24  | tom.anderson@gmail.com    | 901234   | Boston
Amy Taylor      | 20  | amy.taylor@gmail.com      | 123456   | Atlanta
Ryan Thomas     | 22  | ryan.thomas@gmail.com     | 234567   | Dallas
Jessica Lee     | 21  | jessica.lee@gmail.com     | 345678   | Denver

In [12]:
# Apply inner join operation
db = sqlite3.connect('join_example.db')
c = db.cursor()
result = c.execute('SELECT student.name, student.age, student.mail, address.pin_code, address.location FROM student INNER JOIN address ON student.student_id = address.student_id').fetchall()
print(f"Total records after inner join: {len(result)}")
print("=" * 90)
print(f"{'Name':<15} | {'Age':<3} | {'Email':<25} | {'Pin Code':<8} | {'Location':<15}")
print("-" * 90)
for record in result:
    print(f"{record[0]:<15} | {record[1]:<3} | {record[2]:<25} | {record[3]:<8} | {record[4]:<15}")
db.close()

Total records after inner join: 12
==========================================================================================
Name            | Age | Email                     | Pin Code | Location
------------------------------------------------------------------------------------------
John Doe        | 20  | john.doe@gmail.com        | 123456   | New York
Jane Smith      | 21  | jane.smith@gmail.com      | 234567   | Los Angeles
Mike Johnson    | 19  | mike.johnson@gmail.com    | 345678   | Chicago
Sarah Wilson    | 22  | sarah.wilson@gmail.com    | 456789   | Houston
David Brown     | 20  | david.brown@gmail.com     | 567890   | Phoenix
Emily Davis     | 23  | emily.davis@gmail.com     | 678901   | San Francisco
Chris Miller    | 21  | chris.miller@gmail.com    | 789012   | Seattle
Lisa Garcia     | 19  | lisa.garcia@gmail.com     | 890123   | Miami
Tom Anderson    | 24  | tom.anderson@gmail.com    | 901234   | Boston
Amy Taylor      | 20  | amy.taylor@gmail.com      | 123456   | Atlanta
Ryan Thomas     | 22  | ryan.thomas@gmail.com     | 234567   | Dallas
Jessica Lee     | 21  | jessica.lee@gmail.com     | 345678   | Denver

In [14]:
# Delete a record from the student table
db = sqlite3.connect('join_example.db')
c = db.cursor()
# Assuming we want to delete a student with age 19
c.execute('delete from student where age == 19')
db.commit()
print("Record deleted successfully!")

Record deleted successfully!

In [19]:
# Display all student records clearly
result = c.execute('SELECT * FROM student ORDER BY student_id').fetchall()
print(f"Total students in database: {len(result)}")
print("=" * 90)
print(f"{'ID':<3} | {'Name':<15} | {'Age':<3} | {'Email':<25} | {'Mark':<4}")
print("-" * 90)
for record in result:
    print(f"{record[0]:<3} | {record[1]:<15} | {record[2]:<3} | {record[3]:<25} | {record[4]:<4}")
db.close()

Total students in database: 10
==========================================================================================
ID  | Name            | Age | Email                     | Mark
------------------------------------------------------------------------------------------
1   | John Doe        | 20  | john.doe@gmail.com        | 96
2   | Jane Smith      | 21  | jane.smith@gmail.com      | 92
4   | Sarah Wilson    | 22  | sarah.wilson@gmail.com    | 88
5   | David Brown     | 20  | david.brown@gmail.com     | 95
6   | Emily Davis     | 23  | emily.davis@gmail.com     | 82
7   | Chris Miller    | 21  | chris.miller@gmail.com    | 90
9   | Tom Anderson    | 24  | tom.anderson@gmail.com    | 91
10  | Amy Taylor      | 20  | amy.taylor@gmail.com      | 83
11  | Ryan Thomas     | 22  | ryan.thomas@gmail.com     | 89
12  | Jessica Lee     | 21  | jessica.lee@gmail.com     | 94

In [18]:
#update a record in the student table
db = sqlite3.connect('join_example.db')
c = db.cursor()
# Assuming we want to update the mark of student with ID 1
c.execute('UPDATE student SET mark = 96 WHERE student_id = 1')
db.commit()
print("Record updated successfully!")

Record updated successfully!